#不适用循环，循环是一次性就全部执行完了，100连抽
#用户想点击的时候就抽卡一次

heros = {
    '路飞':'我是要成为海贼王的男人',
    '鸣人':'我是要成为火影的男人！',
    '开阳':'我是要成为刘亦菲的男人！'
}

#列表，里面嵌套字典

heros = [
    {'名字':'漩涡鸣人','稀有度':'5⭐','台词':'我是要成为火影的男人'},
    {'名字':'蒙奇·D·路飞', '稀有度': '5⭐', '台词': '我是要成为海贼王的男人'},
    {'名字':'开阳', '稀有度': '10⭐', '台词': '我是要成为讲课王的男人'},
{'名字':'黑崎一护', '稀有度': '4⭐', '台词': '我是要成为死神王的男人'}
]
# print(heros[2]['台词'])

# for i in range(3): #range [0,1,2]
#     print(f'恭喜您抽到了{heros[i]['稀有度']}级别的英雄-{heros[i]['名字']}\n{heros[i]['台词']}')
#

# for hero in heros:
#     print(f'恭喜您抽到了{hero['稀有度']}级别的英雄-{hero['名字']}\n{hero['台词']}')

import random
import time
#用len(列表名)-1的方式，不管增加还是删除列表，永远都是最大的下标

#def是关键词 是define的缩写，必须写对
#后面的名字无所谓，叫啥都行.名字后面要加个括号,括号后面加个冒号
def chouka():
    for i in range(10):
        index = random.randint(0, len(heros) - 1)  # 随机下标  随机的0,1,2
        hero = heros[index]  # 随机的英雄的字典
        print(f'恭喜您抽到了{hero['稀有度']}级别的英雄-{hero['名字']}\n{hero['台词']}')
        time.sleep(1)

chouka() #调用函数


import time
time.sleep(1)

