#目标：循环用于解决重复的问题
#10次可能还可以复制粘贴，100次呢？
# print('老乡，同学好啊，帮我点一下助个力吧！')
#for...in... 是固定格式
# range(10)  #帮我们生成[0,1,2,3,4,5,6,7,8,9]  [0,10)
# range(1,10) 帮我们生成[1,2,3,4,5,6,7,8,9]  [1,10)
# for i in range(101):
#     print(f'第{i}次助力：老乡，同学好啊，帮我点一下助个力吧！')

# for i in [0,1,2,3,4,5,6,7,8]:
#     print(i)

#循环可以把后面不管是数列，还是字符串，其中的每一个内容，单个的输出出来
# for i in '今天开阳老师真帅啊！':
#     print(i)

# for my_girlfriend in ['刘亦菲','高圆圆','古力娜扎','迪丽热巴']:
#     print(my_girlfriend)

for i in range(10): #你人缘好，有10个朋友
    print('快来帮我助力吧！')
